app/views/users/_form.html.erb

  <% if current_user? && current_user.admin? %>
  Select role <%= select(:user, :role_id, Role.all.collect{|p|[p.role_type,p.id]}.reject { |(role_type, id)| role_type == 'Anonymous'}) %><br />
---
SELECT `roles`.* FROM `roles`