app/views/users/show.html.erb

SELECT `user_details`.* FROM `user_details` WHERE `user_details`.`user_id` = 1 AND `user_details`.`user_detail_setting_id` = 1 LIMIT 1
---
  <b><%= user_detail_setting.field_name %>:</b>
  <% user_detail = UserDetail.find_by_user_id_and_user_detail_setting_id(@user.id,user_detail_setting.id) %>

SELECT `assets`.* FROM `assets` WHERE `assets`.`id` = 1 LIMIT 1
---
        <%  if !user_detail.selected_value.blank? && user_detail.selected_value.to_i != 0 %>
          <% asset=Asset.find(user_detail.selected_value) %>