app/views/users/user_details.html.erb

SELECT `user_details`.* FROM `user_details` WHERE `user_details`.`user_id` = 1 AND `user_details`.`user_detail_setting_id` = 1 LIMIT 1
---
      <% user_detail_setting_value = user_detail_setting.default_value %>
      <% user_detail = UserDetail.find_by_user_id_and_user_detail_setting_id(@user.id,user_detail_setting.id) %>