app/views/shared/_pagelet.erb

SELECT `pagelets`.* FROM `pagelets` WHERE `pagelets`.`handle` = 'help_pagelet' LIMIT 1
---
<% pagelet = Pagelet.find_by_handle(handle)