app/controllers/display_controller.rb

  def index
   @pages = Page.find_all_by_home_page(true)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`home_page` = 1 AND (page_view_type IN ('0','1'))

  def show_page
    @page = Page.find_by_perma_link("/"+params[:permalink])
      unless @page.nil?
        if  @page.type.eql?('ObjectForm')
          @form_submission =  @page.form_submissions.new
        elsif @page.type.eql?('View')
          @object_model=ObjectModel.find_by_id(@page.view_for)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`perma_link` = '/shagdaskh-jhfsg' LIMIT 1
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1