app/controllers/menusets_controller.rb

  def index
    @menusets = Menuset.all
---
SELECT `menusets`.* FROM `menusets`