app/controllers/pagelets_controller.rb

SELECT `pagelets`.* FROM `pagelets`
---
  def index
    @pagelets = Pagelet.all

SELECT `pagelets`.* FROM `pagelets` WHERE `pagelets`.`id` = 1 LIMIT 1
---
  def show
    @pagelet = Pagelet.find(params[:id])

SELECT `pagelets`.* FROM `pagelets` WHERE `pagelets`.`id` = 1 LIMIT 1
---
  def edit
    @pagelet = Pagelet.find(params[:id])

INSERT INTO `pagelets` (`handle`, `display_text`, `created_at`, `updated_at`) VALUES ('shibani', 'zxbvk/l/m', '2011-03-22 12:17:40', '2011-03-22 12:17:40')
---
  def create
    @pagelet = Pagelet.new(params[:pagelet])
    respond_to do |format|
      if @pagelet.save

SELECT `pagelets`.* FROM `pagelets` WHERE `pagelets`.`id` = 1 LIMIT 1
UPDATE `pagelets` SET `handle` = 'help_pagelet', `display_text` = 'help links:', `updated_at` = '2011-03-22 12:43:05' WHERE `pagelets`.`id` = 1
---
  def update
    @pagelet = Pagelet.find(params[:id])
    respond_to do |format|
      if @pagelet.update_attributes(params[:pagelet])

SELECT `pagelets`.* FROM `pagelets` WHERE `pagelets`.`id` = 1 LIMIT 1
DELETE FROM `pagelets` WHERE `pagelets`.`id` = 1
---
  def destroy
    @pagelet = Pagelet.find(params[:id])
    @pagelet.destroy