app/controllers/pages_controller.rb

  def show
    @page = Page.find(params[:id])
    @menu = Menu.find_by_page_id(@page.id)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
SELECT `menus`.* FROM `menus` WHERE `menus`.`page_id` = 1 LIMIT 1

  def create
      @page_type= params[:page_type]
      if @page_type == "ObjectForm"
        @page =ObjectForm.new(params[:object_form])
      else
        @page = Page.new(params[:page])
      end
      if params[:permalnk] == "1"
           @page.perma_link_generate
      end
        @page.home_page = params[:home_page]

    respond_to do |format|
      if @page.save
---
INSERT INTO `pages` (`title`, `body`, `perma_link`, `home_page`, `page_view_type`, `user_id`, `created_at`, `updated_at`) VALUES ('sfdg', '', 'dgdfh', 0, 0, NULL, '2011-03-21 05:23:48', '2011-03-21 05:23:48')

  def update
    @page_type = params[:page_type]
    page_params = params[:page]
    if @page_type == "ObjectForm"
     page_params = params[:object_form]
    end
    @page = Page.find(params[:id])
    if params[:permalnk] == "1"
   	@page.perma_link_generate
    end
     unless page_params[:menu_name].nil?
     unless page_params[:menu_name].empty?
	    menu = Menu.find_by_page_id(@page.id)
	    if menu.nil?
	     menu = Menu.new
	    end
	    menu.name = page_params[:menu_name]
	    menu.parent_id = page_params[:menu_parent_id]
	    menu.page_id = @page.id
            menu.menu_view_type = page_params[:page_view_type]
	    menu.save
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
SELECT `menus`.* FROM `menus` WHERE `menus`.`page_id` = 2 LIMIT 1
UPDATE `pages` SET `perma_link` = '/shagdaskh-jhfsg', `updated_at` = '2011-03-21 06:12:46' WHERE `pages`.`id` = 2

  def destroy
    @page = Page.find(params[:id])
    Page.delete(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
DELETE FROM `pages` WHERE `pages`.`id` = 1