app/controllers/page_variable_settings_controller.rb

SELECT `page_variable_settings`.* FROM `page_variable_settings`
---
  def index
    @page_variable_settings = PageVariableSetting.all

SELECT `page_variable_settings`.* FROM `page_variable_settings` WHERE `page_variable_settings`.`id` = 1 LIMIT 1
---
  def show
    @page_variable_setting = PageVariableSetting.find(params[:id])

SELECT `page_variable_settings`.* FROM `page_variable_settings` WHERE `page_variable_settings`.`id` = 1 LIMIT 1
---
  def edit
    @page_variable_setting = PageVariableSetting.find(params[:id])

INSERT INTO `page_variable_settings` (`name`, `default_value`, `created_at`, `updated_at`) VALUES ('Seo Meta Keywords', 'sm,ab', '2011-03-21 06:25:28', '2011-03-21 06:25:28')
---
  def create
    @page_variable_setting = PageVariableSetting.new(params[:page_variable_setting])

    respond_to do |format|
      if @page_variable_setting.save