app/controllers/sessions_controller.rb

def first_user_create
#Create the First User
   role=Role.where(:role_type=>"Administrator").first
   u = User.where(:role_id=>role.id).first
   if u.nil?
     @user = User.create_setting(params[:user], role)
     #@user = User.new(params[:user])
    # @user.login = @user.email if params[:is_login_type_email]
     #@user.role = role
    # @user.is_activated = true
     if @user.save
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`role_type` = 'Administrator' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`role_id` = 3 LIMIT 1
INSERT INTO `users` (`login`, `email`, `role_id`, `hashed_password`, `salt`, `activation_key`, `is_activated`, `reset_password_key`, `login_count`, `failed_login_count`, `last_request_at`, `current_login_at`, `last_login_at`, `current_login_ip`, `last_login_ip`, `created_at`, `updated_at`) VALUES ('shibani', 'shibanitalukdar1@gmail.com', 3, '1f69b7d91af2881123156b0c2dc901eef9753ffa', 'MxyDViAAwK', NULL, 1, NULL, 0, 0, NULL, NULL, NULL, NULL, NULL, '2011-03-21 05:19:18', '2011-03-21 05:19:18')
UPDATE `settings` SET `setting_value` = 'false', `updated_at` = '2011-03-21 05:19:18' WHERE `settings`.`id` = 2

def create
  if current_user.nil?
     @user = User.where(:login=>params[:login]).first
     user =User.authenticate(params[:login], params[:password])
      u=@user
     respond_to do |format|
      if u.nil?
          flash[:notice]= t(:incorrect_login)
          format.html {render  :new}
      elsif !u.is_activated
        flash[:notice]= t(:user_activation_required)
          format.html {render  :new}
      elsif user.nil?
          u1 = u
          u1.failed_login_count += 1
          u1.save
         flash[:notice]= t(:incorrect_password)
         format.html{ render  :new }
      else
        u2=@user
         flash[:notice] = t(:logged_in)
         self.current_user = u2
         if params[:remember_me]=="1"
           cookies[:remember_me_code] = {:value => current_user.salt, :expires => 30.days.from_now }
         end
         User.save_login(u2)
---
SELECT `users`.`id` FROM `users` WHERE (`users`.`login` = BINARY 'sandeep') AND (`users`.id <> 1) LIMIT 1
UPDATE `users` SET `login_count` = 1, `updated_at` = '2011-03-23 15:57:59' WHERE `users`.`id` = 1