app/controllers/sessions_controller.rb

def first_user_create
#Create the First User
   role=Role.find_by_role_type("Administrator")
   user = User.find_by_role_id(role.id)
   if user.nil?
   @user = User.new(params[:user])
   if params[:is_login_type_email]
     @user.login = @user.email
   end
   @user.role = role
   @user.is_activated = true
   if @user.save
      # Save all the 6 settings
      # Login / Email Authentication Setting
       setting = Setting.find_by_name("is_login_type_email")
---
SELECT `settings`.* FROM `settings` WHERE `settings`.`name` = 'is_login_type_email' LIMIT 1