app/controllers/settings_controller.rb

SELECT `settings`.* FROM `settings`
---
  def index
    @settings = Setting.all

SELECT `settings`.* FROM `settings` WHERE `settings`.`id` = 2 LIMIT 1
---
  def show
    @setting = Setting.find(params[:id])

SELECT `settings`.* FROM `settings` WHERE `settings`.`id` = 2 LIMIT 1
---
  def edit
    @setting = Setting.find(params[:id])

SELECT `settings`.* FROM `settings` WHERE `settings`.`id` = 2 LIMIT 1
UPDATE `settings` SET `setting_value` = 'false', `updated_at` = '2011-03-22 15:36:14' WHERE `settings`.`id` = 2
---
  def update
    @setting = Setting.find(params[:id])
    respond_to do |format|
      if @setting.update_attributes(params[:setting])