app/controllers/user_detail_settings_controller.rb

SELECT `user_detail_settings`.* FROM `user_detail_settings`
---
  def index
    @user_detail_settings = UserDetailSetting.all

SELECT `user_detail_settings`.* FROM `user_detail_settings` WHERE `user_detail_settings`.`id` = 4 LIMIT 1
---
  def show
    @user_detail_setting = UserDetailSetting.find(params[:id])

SELECT `user_detail_settings`.* FROM `user_detail_settings` WHERE `user_detail_settings`.`id` = 4 LIMIT 1
---
  def edit
    @user_detail_setting = UserDetailSetting.find(params[:id])

INSERT INTO `user_detail_settings` (`field_name`, `field_type`, `field_values`, `default_value`, `mandatory`, `created_at`, `updated_at`) VALUES ('Image', 'File', '', '', 0, '2011-03-23 05:38:38', '2011-03-23 05:38:38')
---
  def create
    @user_detail_setting = UserDetailSetting.new(params[:user_detail_setting])

    respond_to do |format|
      if @user_detail_setting.save

SELECT `user_detail_settings`.* FROM `user_detail_settings` WHERE `user_detail_settings`.`id` = 4 LIMIT 1
UPDATE `user_detail_settings` SET `default_value` = '100x100,50x50', `updated_at` = '2011-03-23 15:19:31' WHERE `user_detail_settings`.`id` = 1
---
  def update
    @user_detail_setting = UserDetailSetting.find(params[:id])

    respond_to do |format|
      if @user_detail_setting.update_attributes(params[:user_detail_setting])