app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT `user_detail_settings`.* FROM `user_detail_settings`
---
  def show
    userid = params[:id]
    userid = current_user.id if userid.nil? || !current_user.admin?
    if User.exists?(userid)
    @user = User.find(userid)
    @user_detail_settings=UserDetailSetting.all

SELECT `settings`.* FROM `settings` WHERE `settings`.`name` = 'allow_admin_register_user' LIMIT 1
---
  def new
   if current_user?
     setting = Setting.where(:name=>"allow_admin_register_user").first

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    userid = params[:id]
    userid = current_user.id if userid.nil? || !current_user.admin?
    if User.exists?(userid)
    @user = User.find(userid)

SELECT `users`.`id` FROM `users` WHERE (`users`.`email` = BINARY 'test@gmail.com') AND (`users`.id <> 2) LIMIT 1
INSERT INTO `users` (`login`, `email`, `role_id`, `hashed_password`, `salt`, `activation_key`, `is_activated`, `reset_password_key`, `login_count`, `failed_login_count`, `last_request_at`, `current_login_at`, `last_login_at`, `current_login_ip`, `last_login_ip`, `created_at`, `updated_at`) VALUES ('satish@heurion.com', 'satish@heurion.com', 2, '98d98505d1e3d16311a9ea298fd8bdcb9e4a96c5', 'NcbhwaV34S', NULL, 0, NULL, 0, 0, NULL, NULL, NULL, NULL, NULL, '2011-03-21 15:25:51', '2011-03-21 15:25:51')
---
  def create
    @user = User.new(params[:user])
    @user.login = @user.email if @user.login.blank?
    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `hashed_password` = '752040efcc60a0716cf2be7dec3c75875a94669d', `updated_at` = '2011-03-23 11:05:12' WHERE `users`.`id` = 2
---
  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def destroy
    @user = User.find(params[:id])

SELECT `user_detail_settings`.* FROM `user_detail_settings`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def user_details
    @user_detail_settings=UserDetailSetting.all
    respond_to do |format|
      unless @user_detail_settings.empty?
        @user=User.find(params[:id])

SELECT `user_detail_settings`.* FROM `user_detail_settings`
SELECT `user_details`.* FROM `user_details` WHERE `user_details`.`user_id` = 1 AND `user_details`.`user_detail_setting_id` = 1 LIMIT 1
INSERT INTO `assets` (`upload_file_name`, `upload_content_type`, `upload_file_size`, `created_at`, `updated_at`) VALUES (NULL, NULL, NULL, '2011-03-23 07:34:30', '2011-03-23 07:34:30')
INSERT INTO `user_details` (`user_id`, `user_detail_setting_id`, `selected_value`, `created_at`, `updated_at`) VALUES (1, 1, 'Bangalore', '2011-03-23 06:39:56', '2011-03-23 06:39:56')
DELETE FROM `assets` WHERE `assets`.`id` = 2
SELECT `assets`.* FROM `assets` WHERE `assets`.`id` = 0 LIMIT 1
---
 def update_details
    user_id=params[:user_id]
    form_field=params[:form_field]
    mandatory_failed = false
    unless form_field.nil?
      UserDetailSetting.all.each do |user_detail_setting|
        if user_detail_setting.mandatory && form_field[user_detail_setting.field_name].blank?
          mandatory_failed = true
          break
        end
        user_detail=UserDetail.where(:user_id=>user_id ,:user_detail_setting_id=>user_detail_setting.id).first
        user_detail=UserDetail.new if user_detail.nil?
        user_detail.user_id=user_id if user_detail.user_id.nil?
        user_detail.user_detail_setting_id=user_detail_setting.id if user_detail.user_detail_setting_id.nil?
        case user_detail_setting.field_type
        when "File"
          unless form_field[user_detail_setting.field_name].nil?
            asset = Asset.create(:sizes=>user_detail_setting.default_value,:upload=>form_field[user_detail_setting.field_name])
            Asset.find(user_detail.selected_value).destroy if !user_detail.selected_value.blank? && (user_detail.selected_value.to_i != 0)

UPDATE `user_details` SET `selected_value` = '3', `updated_at` = '2011-03-23 07:42:23' WHERE `user_details`.`id` = 1
---
        else
          user_detail.selected_value=form_field[user_detail_setting.field_name]
        end
        user_detail.save

SELECT `user_details`.* FROM `user_details` WHERE `user_details`.`id` = 1 LIMIT 1
SELECT `assets`.* FROM `assets` WHERE `assets`.`id` = 1 LIMIT 1
DELETE FROM `assets` WHERE `assets`.`id` = 1
UPDATE `user_details` SET `selected_value` = NULL, `updated_at` = '2011-03-23 10:44:35' WHERE `user_details`.`id` = 1
---
  def delete_asset
    user_detail = UserDetail.find(params[:id])
    unless user_detail.nil?
      asset = Asset.find(user_detail.selected_value)
      asset.destroy unless asset.nil?
      user_detail.selected_value = nil
      user_detail.save