app/controllers/users_controller.rb

  def destroy
    @user = User.find(params[:id])
    if @user.admin?
     if User.admins.size > 1
---
SELECT COUNT(*) FROM `users` WHERE (role_id = 3)