app/views/layouts/_dropdownmenu.erb

<% output = ""
menuset = Menuset.find_by_name(menusetname)
menus = Menu.find_all_by_menuset_id_and_level(menuset.id,1,:order=>"position")
---
SELECT `menusets`.* FROM `menusets` WHERE `menusets`.`name` = 'Header' LIMIT 1
SELECT `menus`.* FROM `menus` WHERE `menus`.`menuset_id` = 1 AND `menus`.`level` = 1 AND (menu_view_type IN ('0','1')) ORDER BY position

menus.each do |menu|
  submenus = Menu.find_all_by_parent_id(menu.id,:order=>"position")
  if menu.page.nil?
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`parent_id` = 1 AND (menu_view_type IN ('0','1')) ORDER BY position
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1

  else
    menu_link = menu.page.perma_link
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`perma_link` = '/' LIMIT 1