app/views/layouts/_nolistmenu.erb

   output = ""
   menuset = Menuset.find_by_name(menusetname)
   menus = Menu.find_all_by_level_and_menuset_id(1,menuset.id, :order=>"position")
---
SELECT `menusets`.* FROM `menusets` WHERE `menusets`.`name` = 'Footer' LIMIT 1
SELECT `menus`.* FROM `menus` WHERE `menus`.`level` = 1 AND `menus`.`menuset_id` = 2 ORDER BY position